---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.ComposedName
source: html/dc4bb53e-1f1a-ceeb-2875-4595296dce8a.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.ComposedName Property

The composed name for this space.

## Syntax (C#)
```csharp
public string ComposedName { get; }
```

## Remarks
This value is composed of the number and name attributes,
 separated by a space.